{
    "homepage": "https://minecraft.curseforge.com/projects/treasure2",
    "promos": {
    "1.12.2-latest": "1.3.0",
    "1.12.2-recommended": "1.3.0"
  },
    "1.12.2": {
        "0.5.0": "alpha release",
        "0.5.1": "alpha: add Key Ring\nFixed dedicated server crash.",
        "0.5.2": "alpha: add Dread Pirate Chest\nAdded Lava Trap Pit\nAdd Spider, Ruby and Sapphire Lock and Key.\nFixed Key Ring inventory shift-click on item.\nFixed Key Ring unlocking multiple locks.",
        "0.5.3": "alpha: fixed DB script.\nAdded DB as a resource that is copied to the file system.\nAdded Compressor Chest\nAdded Wither Log\nFixed all blockstates.",
        "0.5.4": "alpha: add Jewelled Key, Wither Tree, Wither Chest, Wither Lock, Wither Key, Fog, Poison Fog, Wither Fog",
        "0.6.0": "alpha: updated to use Forge 14.23.4.2705\nUsing Loot Tables instead of custom loot generation.\nFixed chest registry check for Wither Chest.\nFixed chunk count reset in world generators.\nAdded 6 epic (extra powerful) potions.\nFixed Skeleton Key so that it doesnt open Wither Chests.\nAdded Spanish Moss.\nTweaking the Pit gen settings.\nAdded probability config for fog.\nRandomize fog generation and size.\nAdded Mob Trapped Pit.",
        "0.7.0": "beta: add Treasure Tool.\nUpdated recipes.\nUpdated tooltips to reflect what is craftable.\nGeneral Clean up.",
        "0.8.0": "beta: add config option to enable/disable Lock drops when unlocked.\nFix Wither Tree Gen data not being saved to NBT.\nAdded Savanna to the Wither Tree biome white list.\n-Fixed HUGE bug where the chest wasn't saving its inventory and state if it was locked when broken.\nAdded dump() method to TreasureChestBlock.",
        "0.9.0": "beta: fixed when breaking Wither Chest top, that it does not spawn a Wither Chest Top item.\nFixed when scrolling over Wither Chest Top item crashes game.\nFix Wither Log rotations when placed.\nAdded Wither Planks.\nFixed lock rotations when re-placing locked chest.\nFixed bug where you could drop Key Ring when inventory is open and make duplicate keys.\nFixed Tooltips not rendering in custom GUIs.",       
        "1.0.0": "Version Release: fixed Worldgen error on servers.\nAdding Wood Mimic.\nCode cleanup.",  
		"1.0.1": "Fixed keys and keys in keyrings not being damaged on use.\nChanged default probability of key success from 100% to 90%.\n" ,
		"1.1.0": "Update to Forge 14.23.5.2768\nFixed Cocoa beans in loot tables (changed to a dye).\nFixed Ruby, Sapphire, Metallurgists and Skeleton keys not being included in loot tables.\nMoved emerald key to the correct loot_tables.\nFixed Skull Sword entry in loot table (was referencing a gold coin).\nAdded foreign mod support for loot tables.\nAdding lockpicks success probabilities to item info.\nFixed Pilferers abiliy to open uncommon locks.\nChanged the sound of falling Fog from stone to snow.\nRe-balanced lock selection such that rarity-level chests cannot have higher rarity-level locks. ie, a rare lock cannot appear on a scarce chest.\nUpdated Key Rings to only allow stack size of one (1).\nFixed not being able to use locks/keys on a mimic.\nUpdate so that all scarce+ chests have at least one lock.\nFixed Irong and Gold Strongbox name." ,
        "1.2.0": "Added 'Blocks' painting collection.\nAdded custom LootCondition -> mod_present.\nAdded some SGS Metals items to built-in loot tables.\nFixed more Skull Sword entries in loot tables.\nFixed Iron Key entries in loot tables.\nUpdated TreasureChestCommand to correctly generate a chest based on given rarity.\nAdded Skull Chest.\nFixed uncommon armor_tool_chest loot table entry for mocreatures.\nAdded recipe to craft skull chest.\nFixed some mocreatures loot table entries.\n",
        "1.3.0": "Renamed TreasureChestCommand to SpawnChestCommand.\nFixed 2x2 recipes to show up in player's crafting box.\nAdded advancements for recipes.\nIncreased Wither Chests inventory size and added new inventory GUI.\nAdded Eye Patch to the loot tables.\nAdded Gold Skull Chest.\nAdded Sapphire and Ruby items and ore.\nMake Keys unstackable.\nFixed Key Ring decrement by 8 bug.\nAdd SwapIfModPresent loot table function.\nFix pickup/throw KeyRing when its inventory gui is open.\nAdded two new pit trap."
    }
}
