{
    "homepage": "https://minecraft.curseforge.com/projects/treasure2",
    "promos": {
    "1.12.2-latest": "1.12.0",
    "1.12.2-recommended": "1.12.0"
  },
    "1.12.2": {
        "0.5.0": "alpha release",
        "0.5.1": "alpha: add Key Ring\nFixed dedicated server crash.",
        "0.5.2": "alpha: add Dread Pirate Chest\nAdded Lava Trap Pit\nAdd Spider, Ruby and Sapphire Lock and Key.\nFixed Key Ring inventory shift-click on item.\nFixed Key Ring unlocking multiple locks.",
        "0.5.3": "alpha: fixed DB script.\nAdded DB as a resource that is copied to the file system.\nAdded Compressor Chest\nAdded Wither Log\nFixed all blockstates.",
        "0.5.4": "alpha: add Jewelled Key, Wither Tree, Wither Chest, Wither Lock, Wither Key, Fog, Poison Fog, Wither Fog",
        "0.6.0": "alpha: updated to use Forge 14.23.4.2705\nUsing Loot Tables instead of custom loot generation.\nFixed chest registry check for Wither Chest.\nFixed chunk count reset in world generators.\nAdded 6 epic (extra powerful) potions.\nFixed Skeleton Key so that it doesnt open Wither Chests.\nAdded Spanish Moss.\nTweaking the Pit gen settings.\nAdded probability config for fog.\nRandomize fog generation and size.\nAdded Mob Trapped Pit.",
        "0.7.0": "beta: add Treasure Tool.\nUpdated recipes.\nUpdated tooltips to reflect what is craftable.\nGeneral Clean up.",
        "0.8.0": "beta: add config option to enable/disable Lock drops when unlocked.\nFix Wither Tree Gen data not being saved to NBT.\nAdded Savanna to the Wither Tree biome white list.\n-Fixed HUGE bug where the chest wasnt saving its inventory and state if it was locked when broken.\nAdded dump() method to TreasureChestBlock.",
        "0.9.0": "beta: fixed when breaking Wither Chest top, that it does not spawn a Wither Chest Top item.\nFixed when scrolling over Wither Chest Top item crashes game.\nFix Wither Log rotations when placed.\nAdded Wither Planks.\nFixed lock rotations when re-placing locked chest.\nFixed bug where you could drop Key Ring when inventory is open and make duplicate keys.\nFixed Tooltips not rendering in custom GUIs.",       
        "1.0.0": "Version Release: fixed Worldgen error on servers.\nAdding Wood Mimic.\nCode cleanup.",  
		"1.0.1": "Fixed keys and keys in keyrings not being damaged on use.\nChanged default probability of key success from 100% to 90%.\n" ,
		"1.1.0": "Update to Forge 14.23.5.2768\nFixed Cocoa beans in loot tables (changed to a dye).\nFixed Ruby, Sapphire, Metallurgists and Skeleton keys not being included in loot tables.\nMoved emerald key to the correct loot_tables.\nFixed Skull Sword entry in loot table (was referencing a gold coin).\nAdded foreign mod support for loot tables.\nAdding lockpicks success probabilities to item info.\nFixed Pilferers abiliy to open uncommon locks.\nChanged the sound of falling Fog from stone to snow.\nRe-balanced lock selection such that rarity-level chests cannot have higher rarity-level locks. ie, a rare lock cannot appear on a scarce chest.\nUpdated Key Rings to only allow stack size of one (1).\nFixed not being able to use locks/keys on a mimic.\nUpdate so that all scarce+ chests have at least one lock.\nFixed Irong and Gold Strongbox name." ,
        "1.2.0": "Added Blocks painting collection.\nAdded custom LootCondition -> mod_present.\nAdded some SGS Metals items to built-in loot tables.\nFixed more Skull Sword entries in loot tables.\nFixed Iron Key entries in loot tables.\nUpdated TreasureChestCommand to correctly generate a chest based on given rarity.\nAdded Skull Chest.\nFixed uncommon armor_tool_chest loot table entry for mocreatures.\nAdded recipe to craft skull chest.\nFixed some mocreatures loot table entries.\n",
        "1.3.0": "Renamed TreasureChestCommand to SpawnChestCommand.\nFixed 2x2 recipes to show up in players crafting box.\nAdded advancements for recipes.\nIncreased Wither Chests inventory size and added new inventory GUI.\nAdded Eye Patch to the loot tables.\nAdded Gold Skull Chest.\nAdded Sapphire and Ruby items and ore.\nMake Keys unstackable.\nFixed Key Ring decrement by 8 bug.\nAdd SwapIfModPresent loot table function.\nFix pickup/throw KeyRing when its inventory gui is open.\nAdded two new pit trap.",
        "1.3.1": "Fixed BigBottomMobTrapPitGenerator to generate the entire pit correctly -> no missing layers.\nAdded Proximity Block/Spawner.\nUpdated BigBottomMobTrapPitGenerator to use ProximityBlocks to generate mobs.\nFixed skull and bones block bounding box and rendering.\nFixed Held Item into Treasure container bug.\n",
        "1.3.5": "Updated to use GottschCore v1.7\nAdded Cauldron Chest (epic).\nAdded Skeleton Block.\nAdded Marker Generator.\nFixed world.isRemote() checks with GottschCore call WorldInfo.isServer/Client().\nExpose custom loot tables.\nUse of GottschCore Loot Tables system instead of Treasure2s.\nFixed so that Skeletons can be placed in Fog.\n",
        "1.3.6": "Fixed Coin toss in well crash bug.\nRemoved all references to old Loot Tables setup (in ref to coin/well bug).\nFix foreign mod loot table registering.\nUpdated mocreates, sgs metals loot tables to point to right loot tables.\n",
        "1.3.7": "Fixed bug where Treasure items werent being added to chests.\n",   
        "1.4.1": "Added Structures and Structure files.\nUpdate MobTrapPitGenerator to use Proximity Spawners.\nFixed World Generators map - use Enum instead of String.\nRefactor Pit selection code.\n",
        "1.4.2": "Fixed DataFixer server-side crash.\nFixed AbstractChestGenerator crash.\nRemoved Structure Pit Generators that didnt make sense, ie. Big Bottom, Lava Trap.\nExpanded code when retrieving chest coords from pit structure.\n",
        "1.4.3": "Fixed AbstractChestGenerator crash again -> Found edges cases that didnt return StructureInfo on Structure gens.\nFixed findUndergroundCeiling() call.\n", 
        "1.5.0": "Expose/Add custom structure locations.\nSet Key max uses as configurable.\nAdded Chinese language file. Thanks to qyhao.\nAdded new config options - toggle default loot table and templates enforcement.\nRemoved references to mod_present condition on loot tables.\nFix WitherRoot and WitherBranch blocks placement.\nAdded meta file system.\nAdded underwater structures.\nAdded more treasure room structures.",
        "1.5.1": "Fixed Server crash on load - due to biome.getName().\n",
        "1.6.0": "Added White and Black Pearls.\nUpdated Rare and Epic loot tables with pearls.\nAll Generators implement IGenerator.\nRefactored WellGenerators to use Structures.\nRefactored AbstractChestGenerator.\nFixed stacked coins only return 1 loot item bug.\nFixed Wishing Well loot selection.\nFixed all Structure rotation spawn points and checks.\nUpdate all commands be prefixed with t2-.\n",
        "1.6.1": "Fixed NPE on AbstractTreasureChest",
        "1.6.2": "Removed GUI config that was inadvertently added last update.",
        "1.6.3": "Removed debugging code that was causing underwater structures to generate too frequently.",
        "1.7.0": "Refactored config files into one GUI config.\nAdded Desert Wishing Well block.\nFixed Rarity enum value mappings.\nPersisted ChestRegistry.\nFixed Well generation on podzol/mycelium generating mushroom block instead of mushrooms.\nReconfigured folder locations where logging and resource files go (moved out of /mods folder.)\nUsing GottschCore v1.9.0.\n*Fixed chests not generating in some pits.\n*Fixed world properties not clearing between game world loads.\nFixed loading of ChestRegistry.\n",
        "1.8.0": "Added Decay System.\nAdded 8 surface structures.\nAdded SpawnRuins command.\nFixed/enable other spawn commands.\nAdded Spanish translation.\nAdded Russian translation.\nFixed the number of uses a Key has.\nRemoved Lombok library.\nFixed solid base check for Surface/Submerged ruins.\nFixed Wither Tree crash bug.\nUsing GottschCore v1.10.0.\n",
        "1.9.0": "Added Spider Chest.\nAdded recipes for all grave/tombstones.\nFixed config white/black lists on change.\nAll logging config options require mc restart.\nAdded config whitelist for dimensions.\nAdded ability to pass template holder into IRuinGenerators.\nUpdated all SpawnCommands to work from Command blocks.\nAdding fill blocks for under structures so there isnt any overhang when on cliffs etc.\nUsing GottschCore v1.11.0.\nAdded 2 surface structures.\nFixed *huge* bug with decay processor not picking the correct rule.\n",
        "1.10.0": "Replaced fog blocks with mist particles around gravestone and wither trees.\nAdded Bound Soul mob.\nAdded Collapsing Trap Pit.\nAdded 2 submerged structures.\nAdded beached shipwrecks.\nAdded skeleton, zombie and creeper heads to epic loot table.\nAdded config option to turn off gem ores gen.\nAdded config option to toggle default decay ruleset file enforcement.\nAdded config option to turn off starting book.\nUpdated spanish lang file.\nUsing GottschCore 1.12.1",
        "1.11.0": "Added Viking Chest.\nAdded some environmentals to Wither Tree grove.\nAdded Oasis framework and added Desert Oasis.\nAdded 2 surface structures.\nFixed Collpasing Trap Pit in deserts.\nRegistered Ruby and Sapphire with OreDict as gemRuby, gemSappphire.\nFixed loot table error.\nFixed Wither Chest bug.\nResized pearls textures to look more like pearls and less like snowballs.",
		"1.11.1": "Fixed server error on Wither tree gen. Fixed server crash when breaking gravestones.",
		"1.12.0": "Added Charms system.\nAdded Pouches (Coin Pouch, Lucky Pouch, Apprentice's Pouch, Master's Pouch).\nAdded versions to all loot table files - if new versions made, old version will be backed up as .bak files.\nAdded Charms to loot tables.\nAdded relative positioning for t2-chest command.\nConvert KeyRing to use Capabilities.BACKUP your world, you will lose KeyRing items on update!\nUsing GottschCore v1.13.0.\n"
	}
}